#+TITLE: Kapitel 8: Klassen und Objekte
#+INCLUDE: "../template/header.org"

#+STARTUP: showeverything
# TODO states: looks like this has to go on main file and cannot be
# included 
#+TODO: TODO(t) | UEBUNG(u) DONE(d)
#+OPTIONS: tasks:todo

#+LATEX_HEADER: \setcounter{chapter}{8}

** Flexible Konstruktoren -- Beispiel Ellipse 

- Eine Ellipse mit nur einem Radius ist ein Kreis: 

#+BEGIN_SRC python :exports code :results output
%%tutor -t
class Ellipse:
    def __init__(self, x, y, a1, a2=None):
        self.x = x
        self.y = y
        self.achse1 = a1
        if a2:
            self.achse2 = a2
        else:
            self.achse2 = a1

e1 = Ellipse(1, 2, 17.5)
#+END_SRC 

#+RESULTS:
: <__main__.Ellipse object at 0x1010789b0>


** docstring für Klasse 

- Analog zu Funktion: Folgt nach dem ~class~-Ausdruck ein String, so
  wird dieser zum docstring der Klasse
- Ist als vordefiniertes Attribut ~__doc__~  eines Objektes zugreifbar
- Auch: Vordefiniertes Attribut des Klassennamens selbst 

#+BEGIN_SRC python :exports code :results output
  class Ellipse:
      """Eine Ellipsen-Klasse implementiert Datenstruktur und Verhalten
      einer Ellipse."""
  
      def __init__(self, x, y, a1, a2):
          self.x = x
          self.y = y
          self.achse1 = a1
          self.achse2 = a2

  e1 = Ellipse(1, 2, 17.5, 9.3)
  print(e1.__doc__)
  print(Ellipse.__doc__)
#+END_SRC 

#+RESULTS:
: Eine Ellipsen-Klasse implementiert Datenstruktur und Verhalten
:     einer Ellipse.
: Eine Ellipsen-Klasse implementiert Datenstruktur und Verhalten
:     einer Ellipse.


** Aufruf von Methoden 

- Methoden sind auch nur Attribute eines Objekts!
- Also durch Punkt ~.~ ausgewählt
  - Ähnlich wie bei ~self~ in einer Methode 
- Beispiel: 

#+BEGIN_SRC python :exports both :results output
  class Simple:
      def f(self):
          print("f aufgerufen")

  s = Simple()
  print(s.f)
#+END_SRC 

#+RESULTS:
: <bound method Simple.f of <__main__.Simple object at 0x101078588>>

** Aufruf von Methoden (2) 

- Wir müssen ~s.f~ also noch aufrufen!
- Aufruf wie gewohnt durch ~()~
- Beispiel: 

#+BEGIN_SRC python :exports both :results output
  class Simple:
      def f(self):
          print("f aufgerufen")

  s = Simple()
  print(s.f) 
  s.f() 
#+END_SRC 

#+RESULTS:
: <bound method Simple.f of <__main__.Simple object at 0x101178588>>
: f aufgerufen
: f aufgerufen


** Was passiert bei Aufruf? -- Kurzschreibweise auflösen  

#+BEGIN_SRC python :exports both :results output
  class Simple:
      def f(self):
          print("f aufgerufen mit Objekt:", self)

  s = Simple()
  s.f() 
  Simple.f(s) 
#+END_SRC 

#+RESULTS:
: f aufgerufen mit Objekt: <__main__.Simple object at 0x101278588>
: f aufgerufen mit Objekt: <__main__.Simple object at 0x101278588>


** Gleichheit -- Beispiel ohne ~eq~ 

Ohne ~__eq__~: 
- Nur Vergleich /referenziert gleiches Objekt/  zwischen Namen 
- Kein Unterschied zwischen ~==~ und ~is~ 

#+BEGIN_SRC python :exports code :results output
  class Ellipse:
      def __init__(self, x, y, a1, a2):
          self.x = x
          self.y = y
          self.achse1 = a1
          self.achse2 = a2

  e1 = Ellipse(0, 1, 2, 3)
  e2 = e1
  e3 = Ellipse(0, 1, 2, 3)

  print("==:")
  print(e1 == e2)
  print(e1 == e3)
  print(e2 == e3)

  print("is:")
  print(e1 is e2)
  print(e1 is e3)
  print(e2 is e3)
#+END_SRC 

#+RESULTS:
: ==:
: True
: False
: False
: is:
: True
: False
: False


** Gleichheit -- Beispiel mit ~eq~ 

Mit  ~__eq__~: 
- ~==~ ruft ~__eq__~ auf und macht inhaltlichen Vergleich
- ~is~ wie oben: Referenziert gleiches Objekt? 


#+BEGIN_SRC python :exports code :results output
%%tutor -t
class Ellipse:
    def __init__(self, x, y, a1, a2):
        self.x = x
        self.y = y
        self.achse1 = a1
        self.achse2 = a2

    def __eq__(self, otherEllipse):
        return (
            self.x == otherEllipse.x and
            self.y == otherEllipse.y and
            self.achse1 == otherEllipse.achse1 and
            self.achse2 == otherEllipse.achse2
            )

e1 = Ellipse(0, 1, 2, 3)
e2 = e1
e3 = Ellipse(0, 1, 2, 3)

print("==:")
print(e1 == e2)
print(e1 == e3)
print(e2 == e3)

print("is:")
print(e1 is e2)
print(e1 is e3)
print(e2 is e3)
#+END_SRC 

#+RESULTS:
: True
: True
: True
: is:
: True
: False
: False

** Ellipse -- mit ~str~

#+Begin_SRC python :exports code :results output
    class Ellipse:
        def __init__(self, x, y, a1, a2):
            self.x = x
            self.y = y
            self.achse1 = a1
            self.achse2 = a2

        def __str__(self):
            return ("Ellipse at ({},{}) with axes {},{}".
                    format(self.x, self.y,
                           self.achse1, self.achse2))

        def verschiebe(self, deltax, deltay):
            self.x += deltax
            self.y += deltay
    
        def istKreis(self):
            return self.achse1 == self.achse2

    e = Ellipse(0, 1, 2, 3)
    print(e)
    print(e.istKreis())
    e.verschiebe(-2, +5)
    print(e)
#+END_SRC 

#+RESULTS:
: Ellipse at (0,1) with axes 2,3
: False
: Ellipse at (-2,6) with axes 2,3







** ~self~-lose Methoden 

- Ist so etwas denkbar? Was wäre die Semantik? 

#+BEGIN_SRC python :exports both :results output
  class C:
      def f():
          print("Methode ohne self")

  c1 = C()
  print(c1)
#+END_SRC 

#+RESULTS:
: <__main__.C object at 0x101278630>

** ~self~-lose Methoden -- Aufruf nur bei Klasse? 

- Wie wäre es mit Aufruf nur über die Klasse selbst? 

#+BEGIN_SRC python :exports code :results output
  class C:
      def f():
          print("Methode ohne self aufgerufen")

  C.f()
#+END_SRC 

#+RESULTS:
: Methode ohne self aufgerufen

** Expliziter Namensraum für Zugriff 


- Notation: Wir stellen den Namen des Namensraums der Variable voran, mit
  ~.~ getrennt
  - Genauso wie bei Zugriff auf Funktion! 
- Beispiel: 

#+BEGIN_SRC python :exports both :results output
  class C:
      x = 17
      def f():
          print("f kennt Wert von x:", C.x)
	  C.x += 1

  C.f() 
  C.f() 
#+END_SRC 

#+RESULTS:
: f kennt Wert von x: 17
: f kennt Wert von x: 18

** Beispiel: Anzahl der erzeugten Objekte zählen -- Code 

#+BEGIN_SRC python :exports both :results output
  class Counted:
      zaehler = 0
  
      def __init__(self):
          Counted.zaehler += 1

      def printInstances():
          print("Erzeugt: {}".format(
              Counted.zaehler))

  c1 = Counted()
  c2 = Counted()
  Counted.printInstances()
#+END_SRC 

#+RESULTS:
: Erzeugt: 2



** Methoden von ~string~: ~format~

- Ausgabe von Werte: Meist mit Text drum herum
- Einfache Methode:
  - In einer Zeichenkette {} für einzufügende Werte vorsehen
  - Auf diesen Zeichenkette Methode ~format~ anwenden, mit einem
    Parameter pro {}-Paar
  - Ersetzt {} mit übergebenen Werten 
- ~format~ kann Werte auch unterschiedlich formatieren
  - Siehe [[https://docs.python.org/3/library/string.html#format-specification-mini-language][Dokumentation zu Formatting-Syntax]] und Übung 

Beispiel: 
#+BEGIN_SRC python :exports both :results output
s = "Dies {} ein {} für {}!".format("ist", "Beispiel", "GP1")
print(s)

coord = (3.14, 2.71)
s = "Der Punkt ist bei ({p[0]}, {p[1]})".format(p=coord)
print(s)
#+END_SRC 

#+RESULTS:
: Dies ist ein Beispiel für GP1!
: Der Punkt ist bei (3.14, 2.71)

** Methoden von ~string~: ~join~

- Nimmt eine Liste von Strings als Parameter, /verbindet/ die Liste
  mit dem gegebenen String
  - Nur zwischen Elementen, nicht vor erstem oder nach letztem Element
    der Liste 
- Sehr nützlich, um Listen kompakt auszugeben 

#+BEGIN_SRC python :exports both :results output
l = ["17", "42", "abc"]
print(l)
print(" -- ".join(l))
#+END_SRC 

#+RESULTS:
: ['17', '42', 'abc']
: 17 -- 42 -- abc


